src/oy19_by21_pr15_bp9_mf11/conf/DataProcessors/ЗаполнениеГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеГрафика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/InformationRegisters/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/DataProcessors/ЗаполнениеГрафика/Ext/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.График.Установить(График);
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.Дата = Дат Тогда
			Запись.Часов    = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 8);
			Запись.Дней     = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 1);
			Запись.Вечерние = ?(Найти("135", Строка(ДеньНедели(Дат))), 2, 0);
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата     = Дат;
				НоваяЗапись.График   = График;
				НоваяЗапись.Часов    = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 8);
				НоваяЗапись.Дней     = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 1);
				НоваяЗапись.Вечерние = ?(Найти("135", Строка(ДеньНедели(Дат))), 2, 0);
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Запись.Часов    = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 8);
				Запись.Дней     = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 1);
				Запись.Вечерние = ?(Найти("135", Строка(ДеньНедели(Дат))), 2, 0);
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата     = Дат;
		Запись.График   = График;
		Запись.Часов    = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 8);
		Запись.Дней     = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 1);
		Запись.Вечерние = ?(Найти("135", Строка(ДеньНедели(Дат))), 2, 0);
		
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры
